In [1]:
import pandas as pd

In [2]:
car=pd.read_csv('train-data.csv')

In [3]:
car.head()

,Unnamed: 0,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74

In [4]:
car.shape

(6019, 14)

In [5]:
car.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6019 entries, 0 to 6018
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         6019 non-null   int64
 1   Name               6019 non-null   object
 2   Location           6019 non-null   object
 3   Year               6019 non-null   int64
 4   Kilometers_Driven  6019 non-null   int64
 5   Fuel_Type          6019 non-null   object
 6   Transmission       6019 non-null   object
 7   Owner_Type         6019 non-null   object
 8   Mileage            6017 non-null   object
 9   Engine             5983 non-null   object
 10  Power              5983 non-null   object
 11  Seats              5977 non-null   float64
 12  New_Price          824 non-null    object
 13  Price              6019 non-null   float64
dtypes: float64(2), int64(3), object(9)
memory usage: 658.5+ KB

In [6]:
car['Year'].unique()

array([2010, 2015, 2011, 2012, 2013, 2016, 2018, 2014, 2017, 2007, 2009,
       2008, 2019, 2006, 2005, 2004, 2002, 2000, 2003, 1999, 2001, 1998],
      dtype=int64)

In [7]:
car['Price']

0        1.75
1       12.50
2        4.50
3        6.00
4       17.74
        ...
6014     4.75
6015     4.00
6016     2.90
6017     2.65
6018     2.50
Name: Price, Length: 6019, dtype: float64

In [8]:
car['Price'] = car['Price'].round(0).astype(int)

In [9]:
car['Price']

0        2
1       12
2        4
3        6
4       18
        ..
6014     5
6015     4
6016     3
6017     3
6018     2
Name: Price, Length: 6019, dtype: int32

In [10]:
car.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6019 entries, 0 to 6018
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         6019 non-null   int64
 1   Name               6019 non-null   object
 2   Location           6019 non-null   object
 3   Year               6019 non-null   int64
 4   Kilometers_Driven  6019 non-null   int64
 5   Fuel_Type          6019 non-null   object
 6   Transmission       6019 non-null   object
 7   Owner_Type         6019 non-null   object
 8   Mileage            6017 non-null   object
 9   Engine             5983 non-null   object
 10  Power              5983 non-null   object
 11  Seats              5977 non-null   float64
 12  New_Price          824 non-null    object
 13  Price              6019 non-null   int32
dtypes: float64(1), int32(1), int64(3), object(9)
memory usage: 634.9+ KB

In [11]:
missing_data = car.isnull()
missing_data.head()

,Unnamed: 0,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,False,False,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False,True,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,True,False
4,False,False,False,False,False,False,False,False,False,False,False,False,True,False

In [12]:
for column in missing_data.columns.values.tolist():
    print(column)
    print (missing_data[column].value_counts())
    print("")

Unnamed: 0
False    6019
Name: Unnamed: 0, dtype: int64

Name
False    6019
Name: Name, dtype: int64

Location
False    6019
Name: Location, dtype: int64

Year
False    6019
Name: Year, dtype: int64

Kilometers_Driven
False    6019
Name: Kilometers_Driven, dtype: int64

Fuel_Type
False    6019
Name: Fuel_Type, dtype: int64

Transmission
False    6019
Name: Transmission, dtype: int64

Owner_Type
False    6019
Name: Owner_Type, dtype: int64

Mileage
False    6017
True        2
Name: Mileage, dtype: int64

Engine
False    5983
True       36
Name: Engine, dtype: int64

Power
False    5983
True       36
Name: Power, dtype: int64

Seats
False    5977
True       42
Name: Seats, dtype: int64

New_Price
True     5195
False     824
Name: New_Price, dtype: int64

Price
False    6019
Name: Price, dtype: int64

In [13]:
car = car.fillna(car.mode().iloc[0])
car.head()

,Unnamed: 0,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,4.78 Lakh,2
1,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,4.78 Lakh,12
2,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4
3,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,4.78 Lakh,6
4,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,4.78 Lakh,18

In [14]:
car['Seats'] = car['Seats'].round(0).astype(int)

In [15]:
car.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6019 entries, 0 to 6018
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         6019 non-null   int64
 1   Name               6019 non-null   object
 2   Location           6019 non-null   object
 3   Year               6019 non-null   int64
 4   Kilometers_Driven  6019 non-null   int64
 5   Fuel_Type          6019 non-null   object
 6   Transmission       6019 non-null   object
 7   Owner_Type         6019 non-null   object
 8   Mileage            6019 non-null   object
 9   Engine             6019 non-null   object
 10  Power              6019 non-null   object
 11  Seats              6019 non-null   int32
 12  New_Price          6019 non-null   object
 13  Price              6019 non-null   int32
dtypes: int32(2), int64(3), object(9)
memory usage: 611.4+ KB

In [16]:
x=car.drop(columns='Price')
y=car['Price']

In [17]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2)

In [18]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.linear_model import LinearRegression
from sklearn.metrics import r2_score

In [19]:
ohe = OneHotEncoder()
ohe.fit(x[['Name','Location','Fuel_Type','Transmission','Owner_Type','Mileage','Engine','Power','New_Price']])

OneHotEncoder()

In [20]:
column_trans = make_column_transformer((OneHotEncoder(categories=ohe.categories_),['Name','Location','Fuel_Type','Transmission','Owner_Type','Mileage','Engine','Power','New_Price']),remainder='passthrough')

In [21]:
lr=LinearRegression()

In [22]:
pipe=make_pipeline(column_trans,lr)

In [23]:
pipe.fit(x_train,y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(categories=[array(['Ambassador Classic Nova Diesel', 'Audi A3 35 TDI Attraction',
       'Audi A3 35 TDI Premium', ..., 'Volvo XC60 D5 Inscription',
       'Volvo XC90 2007-2015 D5 AT AWD', 'Volvo XC90 2007-2015 D5 AWD'],
      dtype=object),
                                                                            array(['Ahmedabad', 'Bangalore', 'Ch...
       '9.74 Lakh', '9.78 Lakh', '9.79 Lakh', '9.83 Lakh', '9.89 Lakh',
       '9.93 Lakh', '9.96 Lakh', '9.97 Lakh', '9.99 Lakh', '91.23 Lakh',
       '91.38 Lakh', '92.5 Lakh', '92.79 Lakh', '95.04 Lakh',
       '95.13 Lakh', '95.38 Lakh', '99.92 Lakh'], dtype=object)]),
                                                  ['Name', 'Location',
                                                   'Fuel_Type', 'Transmission',
                                                   'Owner_Type', 'Mileage',
                                                   'Engine', 'Power',
                                                   'New_Price'])])),
                ('linearregression', LinearRegression())])

In [24]:
y_pred=pipe.predict(x_test)

In [25]:
y_pred

array([ 0.75278611,  1.36658812, 28.39899653, ...,  3.85547901,
        5.79794533,  5.52052942])

In [26]:
r2_score(y_test,y_pred)*100

81.75780117118497